Author=ali.fhoula@lycos.com
Name=ali fhoula
SourceLANGID=1033
LANGID=7169
Generator=DKLang Translation Editor v3.0
LastModified=2010-02-16 06:59:15

[dAbout]
00000001=بخصوص
00000004=الإنترنت
00000005=موافق
00000006=بريد إلكتروني

[dDiffLog]
00000001=اختلافات موجودة
00000002=غلق
00000003=المجموع
00000004=تترجم تلقائيا جميع التدوينات الغير مترجمة باستخدام مستودع الترجمة
00000005=مساعدة

[dFind]
00000001=بحث مع التعويض
00000003=غلق
00000004=البحث على
00000006=خيارات
00000007=حالة دقيقة
00000008=الكلمات الجامعة فقط
00000010=بحث المختارات فقط
00000011=الأصل
00000012=من دخول التدوين\n&كامل النطاق\n
00000013=اتجاه
00000014=إلى الأمام\nإلى الخلف\n
00000015=تلقين و استبدال
00000016=تعويض الكلّ
00000017=تعويض مع
00000018=المجال
00000019=البحث على أسماء التدوين
00000020=البحث على القيم الأصلية
00000021=البحث على قيم تمت ترجمتها
00000022=مساعدة

[dOpenFiles]
00000001=فتح ملفات اللغة
00000002=مصدر ملف اللغة
00000003=تصفح
00000004=تصفح
00000005=تصفح
00000006=(استخدام ملف الترجمة التالي لعرض القيم (بدلا من تلك التي من مصدر الملف
00000007=إنشاء ترجمة جديدة
00000008=فتح ملف ترجمة موجود
00000009=موافق
00000010=إلغاء
00000011=مساعدة

[dPromptReplace]
00000001=تأكيد التعويض
00000009=نعم
00000010=إلغاء
00000012=تعويض الكلّ
00000013=لا
00000014=مساعدة

[dSettings]
00000001=إعدادات البرنامج
00000002=موافق
00000003=إلغاء
00000005=مسار مستودع الترجمة
00000006=(في هذه الحالة عليك تعيين اختصارات يدويا في وقت لاحق)
00000007=تصفح
00000008=إزالة حرف البادئة ('&&') عند إضافة سلاسل إلى مستودع
00000009=تلقائيا إضافة ترجمات جديدة إلى مستودع
00000013=خطوط الواجهة
00000014=خطوط الجدول
00000015=لا تحذير إذا لغة المصدر والترجمة قد يتم حفظهم بترميزات مختلفة
00000016=المودع  عندنا
00000017=الواجهة
00000018=مساعدة

[dTranProps]
00000001=خصائص الترجمة
00000002=(مصدر اللغة(التي تستخدم لترجمة مستودع
00000003=لغة الترجمة
00000004=المؤلف
00000005=('معلمات إضافية (في شكل 'اسم = قيمة
00000006=مسار البرنامج/الإصدار
00000007=موافق
00000008=إلغاء
00000009=مساعدة

[fMain]
00000002=اللائحة الرئيسية
00000003=ملف
00000004=تحرير
00000005=عرض
00000006=شريط الأدوات
00000007=عرض/إخفاء شريط الأدوات
00000008=مصدر التدوين الحالي
00000009=عرض/lإخفاء لوحة مصدر التدوين الحالي
00000010=شريط الحالة
00000011=عرض/إخفاء شريط الحالة
00000012=Language/اللغة
00000013=الأدوات
00000014=مساعدة
00000015=شريط الأدوات
00000018=العدد الجملي لمكون التدوينات
00000020=إجمالي عدد التدوينا و الصفة و العناصر / غير مترجمة
00000022=مجموع عدد الثابت للتدوينات/غير مترجمة
00000024=عدد التدوينات المودعة
00000025=ملف
00000026=جديد أو فتح
00000027=جديد أو فتح|إنشاء ترجمة جديدة أو فتح ملف موجود أولا
00000028=ملف
00000029=حفظ
00000030=حفظ|حفظ الترجمة الحالية
00000031=ملف
00000032=حفظ بإسم
00000033=حفظ في|حفظ الترجمة الحالية في ملف آخر
00000034=ملف
00000035=غلق
00000036=غلق|غلق الملفات المفتوحة حاليا
00000037=ملف
00000038=خروج
00000039=خروج|خروج من البرنامج
00000040=الأدوات
00000041=إعدادات البرنامج
00000042=إعدادات البرنامج|عرض أو تغيير إعدادات البرنامج
00000043=مساعدة
00000044=بخصوص
00000045=بخصوص|الإصدار و معلومات حقوق التأليف
00000046=تحرير
00000047=الانتقال إلى التدوين المقبل الغير مترجم
00000048=الانتقال إلى التدوين المقبل الغير مترجم أو المترجم آليا
00000049=تحرير
00000050=الانتقال إلى التدوين المقبل الغير مترجم
00000051=الانتقال إلى التدوين المقبل الغير مترجم أو المترجم آليا
00000058=تحرير
00000059=خصائص الترجمة
00000060=خصائص الترجمة|عرض أو تعديل خصائص الترجمة
00000064=الأدوات
00000065=إختيار الترجمة الآلية
00000066=إختيار الترجمة الآلية|الترجمة الآلية للتدوينات الغير مترجمة المحدد حاليا باستخدام مخزون الترجمة
00000067=الأدوات
00000068=إضافة المختارات للمستودع
00000069=إضافة المختارات للمستودع|إضافة التدوينات المختارة لمستودع الترجمة
00000073=مساعدة
00000074=التحقق من التحديثات
00000075=التحقق من التحيينات|التحقق من توفر ترقية للبرنامج على الانترنت
00000076=مساعدة
00000077=DKLang الصفحة الرئيسية لمحرر الترجمة
00000078=الصفحة الرئيسية لمحرر الترجمة|فتح الصفحة الرئيسية للبرنامج في المتصفح DKLang
00000079=مساعدة
00000080=المنتوج و الدعم الفني
00000081=دعم فني للمنتوج|فتح صفحة الدعم الفني للمنتوج في المتصفح
00000082=مساعدة
00000083=DK Software موقع
00000084=موقع|فتح الصفحة الرئيسية لبائع الترجمة الآلية في المتصفح DK Software
00000087=الأنترنت
00000088=تحرير
00000089=تبديل التركيز
00000090=تبديل التركيز|تبديل التركيز بين الجدول و قيمة الترجمة المحررة
00000091=تحرير
00000092=التدوين السابق
00000093=التدوين السابق|خطوة إلى التدوين السابق
00000094=تحرير
00000095=التدوين التالي
00000096=التدوين التالي|خطوة إلى التدوين التالي
00000097=خصائص التدوين
00000098=مصدر التدوين الحالي
00000099=التدوين الحالي المترجم
00000100=غير مترجم
00000101=حالة التدوين
00000102=ترجمة ذاتية
00000103=خصائص التدوين
00000104=التدوين المترجم حاليا
00000105=المكون/الصفة/الثابت
00000106=المعرف
00000107=القيمة الإفتراضية
00000108=القيمة المترجمة
00000109=تحرير
00000110=بحث
00000111=بحث|مداخل البحث باستخدام نمط معين
00000112=تحرير
00000113=البحث التالي
00000114=بحث التالي|العثور على وجود سلسلة فتشت قبل
00000115=تحرير
00000116=استبدال
00000117=استبدال|استبدال سلسلة واحدة مع واحدة آخرى
00000118=دلالات
00000119=عرض/إخفاء لوحة ادخال الترجمة الحالية
00000120=عرض/اخفاء لوحة خصائص الدخول
00000121=دلالات
00000122=عرض/إخفاء لوحة الدلالات
00000123=تحرير
00000124=إضافة دلالة
00000125=إضافة دلالة|إضافة التدوين الحالي إلى قائمة من لهم دلالة
00000126=تحرير
00000127=حذف الدلالة
00000128=حذف دلالة|إزالة الدلالة المرجعية المحددة حاليا
00000129=تحرير
00000130=انتقل إلى الدلالة
00000131=انتقل إلى الدلالة|انتقل إلى الدلالة المحددة حاليا في إطار المرجعية
00000132=شريط الدلالات
00000133=تحرير
00000134=نسخ
00000135=تحرير
00000136=لصق
00000137=تحرير
00000138=قص
00000139=نسخ|نسخ للنص الذي تمّ إنتقائه في الحافظة
00000140=لصق|لصق النص من الحافظة
00000141=قص|قص للنص الذي تمّ إنتقائه و نسخه في الحافظة
00000142=مساعدة
00000143=مساعدة
00000144=مساعدة|عرض مساعد البرنامج

[$CONSTANTS]
SBtn_Find=بحث
SBtn_Replace=تعويض
SConfirm_FileNotSaved=تم تعديله و لكن لم يتم حفظه. هل ترغب في حفظه؟ "%s"ملف الترجمة
SDiffDesc_AddComponent=+المكون: [%s]
SDiffDesc_AddConstant=+الثابت "%s"
SDiffDesc_AddProperty=+ الصفة "%s" (المعرف=%d)
SDiffDesc_ExcessiveEntries=التدوينات التالية تم العثور عليها على نحو مفرط و حذفت من الترجمة
SDiffDesc_MissingEntries=التدوينات التالية لم يتم العثور عليها وأضيفت إلى الترجمة
SDiffDesc_RemoveComponent=- المكون [%s]
SDiffDesc_RemoveConstant=- العنصر "%s"
SDiffDesc_RemoveProperty=- المكون "%s", الصفة مع المعرف=%d
SDiffTotalsText=\tالمكونات\tالصفات\tالثوابت\nإضيفت\t%d\t%d\t%d\nحذفت\t%d\t%d\t%d\nالمجموع\t%d\t%d\t%d
SDlgTitle_Confirm=تأكيد
SDlgTitle_Error=خطأ
SDlgTitle_Info=معلومات
SDlgTitle_SaveTranFileAs=اختيار ملف الترجمة للحفظ في
SDlgTitle_SelectDisplayFile=حدد ملف ترجمة يستخدم للعرض
SDlgTitle_SelectLangSourceFile=إختيار مصدر ملف اللغة
SDlgTitle_SelectTranFile=إختيار ملف الترجمة
SDlgTitle_SelReposPath=حدد مسار مستوع الترجمة
SErrMsg_CharMissing="%s" ناقص
SErrMsg_ConstNameMissing=اسم الثابت الناقص
SErrMsg_DuplicateCompName=نسخة ثانية من اسم المكون "%s"
SErrMsg_DuplicatePropID=نسخة ثانية من معرف الوصف %d
SErrMsg_DuplicatePropName=نسخة ثانية من اسم الوصف "%s"
SErrMsg_FileDoesntExist=غير موجود "%s"ملف
SErrMsg_InvalidCompName=اسم المكون غير صالح "%s"
SErrMsg_LoadLangSourceFailed=خطأ في تحميل لغة المصدر\nالسطر %d: %s
SErrMsg_PropIDInvalid=غير صالح معرف الصفة
SErrMsg_PropIDMissing=معرف الصفة ناقص
SErrMsg_PropNameMissing=اسم الصفة ناقص
SErrMsg_SectionlessEntry=القسم أقل الإدخالات غير مسموح
SErrMsg_SectionNameMissing=مقطع الاسم ناقص
SErrMsg_SrcAndTranLangsAreSame=مصدر اللغات والترجمة ينبغي أن يكون مختلفا
SErrMsg_WrongSectionName=خطأ في تنسيق اسم الصيغة "%s"
SLangSourceFileFilter=DKLang مصدر ملفات اللغة (*.dklang)|*.dklang|كلّ الملفات (*.*)|*.*
SMsg_NoSearchResults=السلسلة "%s" لم يتم العثور عليها.
SMsg_PromptReplace=استبدال التكرار "%s"?
SMsg_ReplacedInfo=استبدال %d تكرارات "%s".
SNode_Constants=الثوابت
SStatusBar_CompCount=المكون %d
SStatusBar_ConstCount=الثابت %d/%d
SStatusBar_PropCount=الصفة %d/%d
SStatusBar_ReposEntryCount=التدوينات %d مستودع
STranFileFilter=DKLang translation ملفات (*.lng)|*.lng|كلّ الملفات (*.*)|*.*
STranFileFilterAnsi=DKLang Ansi ملفات الترجمة (*.lng)|*.lng
STranFileFilterUnicode=DKLang Unicode ملفات الترجمة (*.lng)|*.lng
SWarnMsg_SavingInAnsi=كنت على وشك أن تحفظ الترجمة في مقاييس الشكل في حين أن اللغة المستخدمة الملف المصدر هي ترميز يونيكود.\nتوفير الترجمة بوصفها مقاييس قد ينتج أحرف خاطئة عند عرض برنامج قمت بترجمته. طالما أن البرنامج يستخدم يونيكود أنه يكاد يكون من الأفضل دائما لحفظ الترجمة أيضا كما يونيكود.\n\nهل تريد حفظ الترجمة في ترميز يونيكود بدلا من ذلك؟
SWarnMsg_SavingInUnicode=كنت على وشك أن تحفظ الترجمة في شكل يونيكود في حين أن اللغة المستخدمة الملف المصدر هي مقاييس الترميز.\nتوفير الترجمة في يونيكود قد منع البرنامج من أن يكون قادر على استخدامها. طالما أن البرنامج يستخدم مقاييس ، أكثر الطرق الآمنة لحفظ الترجمة أيضا في مقاييس.\n\nهل تريد حفظ الترجمة في مقاييس ترميز بدلا من ذلك؟
